       IDENTIFICATION DIVISION.
       PROGRAM-ID. BONJOUR.

       PROCEDURE DIVISION.
           DISPLAY "Hello, COBOL sur Ubuntu !".
           STOP RUN.